ES1C/src/InformationRegisters/md_ОчередьДанныхКОтправкеВElasticsearch/md_ОчередьДанныхКОтправкеВElasticsearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>md_ОчередьДанныхКОтправкеВElasticsearch</name>
  <resources>
    <name>СообщениеОтправки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерверElasticsearch</name>
    <type>
      <types>CatalogRef.md_СервераElasticsearch</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексES</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.md_ОбъектыВерсионированияElasticSearch</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ES1C/src/InformationRegisters/md_ОчередьДанныхКОтправкеВElasticsearch/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль менеджера регистра сведений "md_ОчередьДанныхКОтправкеВElasticsearch"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ДобавитьУдалитьЗаписьИзРегистра(СтруктураЗаписиРегистра, Удаление = Ложь) Экспорт
	
	НабораЗаписейРегистра = РегистрыСведений.md_ОчередьДанныхКОтправкеВElasticsearch.СоздатьНаборЗаписей();
	НабораЗаписейРегистра.Отбор.ДатаРегистрации.Установить(СтруктураЗаписиРегистра.ДатаРегистрации);
	НабораЗаписейРегистра.Отбор.СерверElasticsearch.Установить(СтруктураЗаписиРегистра.СерверElasticsearch);
	НабораЗаписейРегистра.Отбор.ИндексES.Установить(СтруктураЗаписиРегистра.ИндексES);
	НабораЗаписейРегистра.Отбор.СсылкаНаОбъект.Установить(СтруктураЗаписиРегистра.СсылкаНаОбъект);
	
	Если НЕ Удаление Тогда
		
		ЗаписьНабора = НабораЗаписейРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтруктураЗаписиРегистра); 
			
	КонецЕсли; 
	
	НабораЗаписейРегистра.Записать();
	
КонецПроцедуры
 
#КонецОбласти
